app/controllers/drinks_controller.rb

SELECT id, title, description, steps, source, ingredients FROM "drinks"
---
  def index
    @drinks = Drink.select("id, title").all

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
     @drink = Drink.find(params[:id])

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_drink
      @drink = Drink.find(params[:id])